In [66]:
import pandas as pd
import numpy as np
data={
    'name':['Pandik','Bamboo','Fuzzy','Buk'],
    'age':[25,26,27,np.nan],
    'bamboo_sticks':[15,20,12,np.nan]
}
df=pd.DataFrame(data=data)
print(df)
df_name=df['name']
df_age=df['age']
df_bamboo=df['bamboo_sticks']
print(df_name)
print(df_age)
print(df_bamboo)
print(df.info)
print(df['age']>7)

     name   age  bamboo_sticks
0  Pandik  25.0           15.0
1  Bamboo  26.0           20.0
2   Fuzzy  27.0           12.0
3     Buk   NaN            NaN
0    Pandik
1    Bamboo
2     Fuzzy
3       Buk
Name: name, dtype: object
0    25.0
1    26.0
2    27.0
3     NaN
Name: age, dtype: float64
0    15.0
1    20.0
2    12.0
3     NaN
Name: bamboo_sticks, dtype: float64
<bound method DataFrame.info of      name   age  bamboo_sticks
0  Pandik  25.0           15.0
1  Bamboo  26.0           20.0
2   Fuzzy  27.0           12.0
3     Buk   NaN            NaN>
0     True
1     True
2     True
3    False
Name: age, dtype: bool

In [42]:
df['age']>7
df
c=df.loc[df['name']=='Pandik','age']=26;
print(c)
df
c=df.loc[df['age']==26,'bamboo_sticks']=16
c
df

c=df.loc[df['name']=='Fuzzy','age']=30
c
df

26

     name  age  bamboo_sticks
0  Pandik   26             16
1  Bamboo   26             16
2   Fuzzy   30             12

In [48]:
# df=df.drop(['age','name'],axis=1)
# df
df.iloc[0]
df.iloc[2]
df.iloc[1]

bamboo_sticks    16
Name: 1, dtype: int64

In [58]:
df
df.loc[0:2]

     name   age  bamboo_sticks
0  Pandik  25.0           15.0
1  Bamboo  26.0           20.0
2   Fuzzy  27.0           12.0

In [61]:
df.iloc[0:1,1:3]

    age  bamboo_sticks
0  25.0           15.0

In [68]:
df=pd.DataFrame({
    'name':['Pandy','Boobbo','Fuzzy','Flufy'],
    'age':[5,7,8,9],
    'Baboo_sticks':[15,20,12,18]
},index=['a','b','c','d'])
print(df)
df.loc['a']

     name  age  Baboo_sticks
a   Pandy    5            15
b  Boobbo    7            20
c   Fuzzy    8            12
d   Flufy    9            18

name            Pandy
age                 5
Baboo_sticks       15
Name: a, dtype: object

In [103]:
df.loc[['a','c'],['name','age']]
df
df.loc[['c','d'],['name','Baboo_sticks']]

    name  Baboo_sticks
c  Fuzzy            12
d  Flufy            18

In [116]:
import pandas as pd;
df__json=pd.read_json('./data.json')
df__json
df__json.head()
df__json.shape
csv=df__json.to_csv('json_to_csv.csv',index=False)
csv
csv=pd.read_csv('./json_to_csv.csv')
csv
# csv.to_excel('excel_file.xlsx',index=False);

   id     name  age   department  salary
0   1    Alice   25  Engineering   70000
1   2      Bob   30    Marketing   55000
2   3  Charlie   28           HR   60000
3   4    David   35      Finance   75000

In [141]:
csv[['age','salary']]
csv[(csv['age']>28) &(csv['salary']>60000)]
csv[(csv['age']>25)]
csv[(csv['department']=='HR')]
left=pd.DataFrame({
    'ID':[1,2,3],
    'Name':['Pandy','Fuzzy','Bamboo']
})
right=pd.DataFrame({
    'ID':[1,2,4],
    'Hobby':['Climbing','Sleeping','Eating']
})
merged__pd=pd.merge(left=left,
                    right=right,
                    on='ID',
                    how='inner')
print(merged__pd)

merged__pd=pd.merge(left=left,
                    right=right,
                    on='ID',
                    how='left')
print(merged__pd)
merged__pd=pd.merge(left=left,
                    right=right,
                    on='ID',
                    how='right')
print(merged__pd)

concatenate_df=pd.concat([left,right],
                         ignore_index=False)
print(concatenate_df)
print('\n')
concatenate_axis=pd.concat([left,right],axis=1)
print(concatenate_axis)

csv[(csv['age']>28) &
    (csv['name']=='Charlie')&
    (csv['department']=='HR')
    ]

   ID   Name     Hobby
0   1  Pandy  Climbing
1   2  Fuzzy  Sleeping
   ID    Name     Hobby
0   1   Pandy  Climbing
1   2   Fuzzy  Sleeping
2   3  Bamboo       NaN
   ID   Name     Hobby
0   1  Pandy  Climbing
1   2  Fuzzy  Sleeping
2   4    NaN    Eating
   ID    Name     Hobby
0   1   Pandy       NaN
1   2   Fuzzy       NaN
2   3  Bamboo       NaN
0   1     NaN  Climbing
1   2     NaN  Sleeping
2   4     NaN    Eating


   ID    Name  ID     Hobby
0   1   Pandy   1  Climbing
1   2   Fuzzy   2  Sleeping
2   3  Bamboo   4    Eating

Empty DataFrame
Columns: [id, name, age, department, salary]
Index: []